{"job_title":{"0":"Junior Software Engineer","1":"Junior Software Developer","2":"Junior Level PHP Developer","3":"Junior Developer","4":"Jr. Software Developer","5":"Junior Developer","6":"Staff Software Engineer","7":"Junior Software Engineer","8":"Junior Software Developer","9":"Junior Web Developer","10":"Junior Level Software Engineer - SKA IV&V","11":"Junior UX\/UI Developer","12":"Junior Software Reverse Engineer","13":"Junior .Net Software Developer","14":"Junior Java Developer"},"company":{"0":"MP RPO","1":"ISPA Technology","2":"American Partner Solutions","3":"FinMC LLC","4":"Omphalos Lifesciences","5":"JST","6":"Home Depot \/ THD","7":"Concept3D","8":"CACI","9":"AMDA","10":"4M Research, Inc.","11":"Red Technologies","12":"Parsons","13":"Peraton","14":"Agri Stats, Inc"},"link":{"0":"https:\/\/www.indeed.com\/rc\/clk?jk=002a28d2183044a1&fccid=dd616958bd9ddc12&vjs=3","1":"https:\/\/www.indeed.com\/rc\/clk?jk=02b9f0af6bb6d0a1&fccid=1c7ed79af7baa631&vjs=3","2":"https:\/\/www.indeed.com\/rc\/clk?jk=a534d1cfd4eb5dbd&fccid=778258601e76a046&vjs=3","3":"https:\/\/www.indeed.com\/company\/Financial-Media-Corp\/jobs\/Junior-Developer-007ab0d60a8472c6?fccid=a4ebfb44bb015640&vjs=3","4":"https:\/\/www.indeed.com\/company\/Omphalos-Lifesciences\/jobs\/Junior-Software-Developer-97c9206aa0d5c345?fccid=66c2b67b0600491f&vjs=3","5":"https:\/\/www.indeed.com\/rc\/clk?jk=5fe11b89efe34795&fccid=1e73d9f9d6a53d53&vjs=3","6":"https:\/\/www.indeed.com\/rc\/clk?jk=17c24d0e3aa784a5&fccid=82e58e9861d48566&vjs=3","7":"https:\/\/www.indeed.com\/rc\/clk?jk=871782c66b2dc7f8&fccid=826beddf3154a5e0&vjs=3","8":"https:\/\/www.indeed.com\/rc\/clk?jk=fc8b51c05d4e472a&fccid=5fca42294cdbc080&vjs=3","9":"https:\/\/www.indeed.com\/rc\/clk?jk=a344880db292709a&fccid=4b9a58dc81ebbf23&vjs=3","10":"https:\/\/www.indeed.com\/rc\/clk?jk=52f636752333038f&fccid=dbb96e19f223635c&vjs=3","11":"https:\/\/www.indeed.com\/rc\/clk?jk=1b060ae468c00e38&fccid=1a2582941ef0aed8&vjs=3","12":"https:\/\/www.indeed.com\/rc\/clk?jk=a9f258cf170c3f9a&fccid=e8f998ddd15bac9c&vjs=3","13":"https:\/\/www.indeed.com\/rc\/clk?jk=b3f7882b6508d252&fccid=7dc8be9efe945d3a&vjs=3","14":"https:\/\/www.indeed.com\/company\/Agri-Stats,-Inc\/jobs\/Junior-Java-Developer-1abb0702ff59ed0c?fccid=e1893cf2b6a6c375&vjs=3"},"description":{"0":"\nWho you are: \nMP's client is looking to bring on a Junior Software Engineer to their growing team. If you have the desire to develop rich and interactive applications in the cloud, have experience with agile software development and enjoy working on a collaborative team; this position could be a great opportunity for you! MP's client is a group of dedicated and multi-faceted individuals who are self-motivated and are excited to be a part of the company that is charting the future of interactive maps, tours, and events. Our teams are full of ideas and everyone's voice gets heard. While our offices are located in Denver, Colorado, and Minneapolis, Minnesota, we are currently operating remotely with a nationally-distributed team. MP's client defines themselves through the values by which they operate: Be Community Minded (Listen), Create Trust Through Open Communication (Speak), Take Time to Grow, Grow Together (Act), Strive to Amaze, Teamwork Unites us (Teamwork) and Fill the Glass (Optimism). If this sounds like you, we would love to chat!\n What you will be doing: \nAs a Junior Software Engineer, you will report directly to the VP of Software Engineering, who will be primarily responsible for providing direction and evaluating your performance.\n This position is for a junior role within our engineering organization, someone who exemplifies our core values, works well with fellow engineering team members, and has the aptitude and drive to learn and contribute in the frontend and backend technologies needed to enhance and evolve our SaaS interactive mapping and virtual tour products.\n Our ideal candidate has: \n\n1+ year of experience (can be coursework\/collegiate experience) using JavaScript (React, Node.js, Express)\n 1+ year of experience (can be coursework\/collegiate experience) using agile software development.\n Education: Completed your Bachelors Degree in Computer Science or related field.\n Preferred Technologies: Mapping Technologies (Google, Mapbox, Leaflet, ESRI, Open Street Maps), Docker and AWS\n\n About our client:\n Founded in 2006, MP's client is a leader in creating immersive online experiences with 3D modeling, interactive maps, and virtual tours. Their products include an online experience platform developed to support marketing, sales, and business processes in a countless number of industries. Their solutions marry art and science in highly detailed, interactive 3D renderings that breathe life into the digital world.\n Additional information:\n\n Full Time Remote Position: Monday - Friday\n Business Casual Attire\n Base Salary Range for this position is $60,000 - $100,000 annually. Final compensation for this role is determined by a variety of factors, such as a candidate's relevant work experience, skills and certifications.\n Benefits including but not limited to: Medical, Dental, Vision, PTO, 14 Paid Holidays Annually + Your Birthday, 401(k) Plan with Employer Match, Life Insurance, Short and Long Term Disability Insurance, Employee Stock Option Plan, Annual Education\/Development for continued learning, etc.\n\n\n","1":"\nJunior Software Developer\nWe are looking for an enthusiastic junior software developer to join our experienced software design team. You will report directly to the development manager and assist with all functions of software coding and design. Your primary focus will be to learn the codebase, gather user data, and respond to requests from senior developers.\nTo ensure success as a junior software developer, you should have a good working knowledge of basic programming languages, the ability to learn new technology quickly, and the ability to work in a team environment. Ultimately, a top-class Junior Software Developer provides valuable support to the design team while continually improving their coding and design skills.\nJunior Software Developer Responsibilities:\n\nAssisting the development manager with all aspects of software design and coding.\nAttending and contributing to company development meetings.\nLearning the codebase and improving your coding skills.\nWriting and maintaining code.\nWorking on minor bug fixes.\nMonitoring the technical performance of internal systems.\nResponding to requests from the development team.\nGathering information from consumers about program functionality.\nWriting reports.\nConducting development tests.\n\nJunior Software Developer Requirements:\n\nBachelor’s degree in Computer Science or Computer Engineering.\nKnowledge of basic coding languages including C++, HTML5, and JavaScript.\nBasic programming experience.\nKnowledge of databases and operating systems.\nGood working knowledge of email systems and Microsoft Office software.\nAbility to learn new software and technologies quickly.\nAbility to follow instructions and work in a team environment.\nDetail-oriented.\n\n","2":"\n\nIf you are a Jr. PHP Developer with experience, please read on! Located in Tampa, Fl. we are the software division of the Fest Corporation Family of Companies which include American Marketing and Mailing and American Visual Brands.\n Top Reasons to Work with Us\n You get to work with other top talent Developers who value the same principles as you do. We encourage learning new techniques, sharing your knowledge with others and invest in the training to get you to the next level. We’re an equal opportunity employer providing a fun but respectful environment to work in. We strive to make your role both challenging and rewarding.\n What You Will Be Doing\n The role is for a Senior Developer to help lead the Web Team into the next generation of web content delivery. We’re looking for someone with experience with multiple frameworks and languages who can quickly learn and understand our code base, help identify architecture and performance improvements, and can drive a transition plan to get there while continuing to improve our user experience.\n What You Need for this Position\n Experience: 1+ yrs PHP software development With the following languages\/frameworks: PHP\/ Symfony, Javascript, CSS, HTML\n What’s In It for You\n For your hard work we are offering a competitive salary benefits and vacation! Dress is Jeans casual with periodic employee team building activities. So, if you are a Jr. PHP Developer with experience, please apply today!\n Applicants must be local applicants authorized to work in the U.S.\n","3":"About FinMC\nFinMC is a financial publishing company focused on retail trading education; an ever-changing, exciting and fast-paced environment. We deliver proprietary financial products and compelling content to our growing subscriber base through various marketing channels.\nWe are a collective team of ~120 employees working in a hybrid environment between “at home” and in our HQ office located near Jacksonville, FL. We thrive in a data-driven world with a laid-back culture, focused on delivering top-notch products and services for our valued customers.\nJob Description\nWe are looking for a highly motivated and code-obsessed candidate to be our Junior Developer. The position will be responsible for developing and maintaining software applications, assisting with software testing and debugging, and collaborating with senior developers to improve the functionality of our products, services and workflows. The ideal candidate should possess a passion for coding and be willing to learn and grow in a dynamic and fast-paced environment. Working knowledge and experience working in a remote environment and marketing business workflows will move you up to the top of the list.\nThe candidate should have a strong foundation to write, read and understand at least one programming language (Java, Python, C++, PhP) and should have an understanding of software development principles and practices, such as agile methodologies, version control systems, and software testing. Additionally, they should be able to analyze and solve complex problems in a logical and systematic way by breaking down problems into smaller components and troubleshooting issues. A keen eye for details and the ability to juggle multiple projects simultaneously is essential to succeeding in this role.\nIf you are a self-starter with a passion for digital technology and an eagerness to learn in a remote capacity, we would love to hear from you. Your impact will be evaluated based on a combination of factors, including the quality and quantity of work, collaboration with the team, and willingness to learn and develop skills. This is a great opportunity to start your career in software development and work with a talented team of professionals. The successful candidate must have a reliable internet connection, a dedicated workspace, and the ability to work independently and collaboratively in a remote environment.\nCore Responsibilities:\n\nAssist with software development tasks, including coding, testing, and debugging\nParticipate in engineering reviews with your team to ensure software development standards are met\nCoding, developing, and testing in Python, PHP, or JavaScript\nTechnical documentation contributions to the production support library\nWrite and maintain clean, efficient, and well-documented code\nCollaborate with customers, team members, and cross-team to recommend new software development technologies and development processes\nResolve, mitigate, and perform root cause analysis on production issues\nInitiates process improvements for new and existing systems\nUtilize database programs and run data queries while maintaining data integrity\nPerform code reviews to ensure quality and maintainability of codebase\nParticipates in the solution design process: requirements gathering and backlog refinement, shapes and guides systems approach, helps with project initiation, contributes to functional design, and leads technical design and development\nOperates in both waterfall and Agile Software Development processes\nHas worked with Salesforce Marketing Cloud, Infusionsoft, Optimizely, or some other Email Software program\nAnalyze user requirements and translate them into software solutions in a remote capacity\nPrepare, sort and organize data for reporting, meeting and presentations.\nEnsure data management procedures comply with standard company policies.\nKeep up-to-date with emerging trends and technologies in software development\nBy the end of the first 30 days, the Junior Developer should be comfortable with the development environment and tools, have an understanding of the company's development methodologies, and be making meaningful contributions to the team's projects.\n\nWhat to Expect - Initial 30 Days:\nWeek 1:\n\nIntroduction to the team and company culture\nOnboarding paperwork and HR orientation\nIntroduction to the software development environment, tools, and processes\nReview of the company's product and development roadmap\nInitial setup of development environment and tools\nPair programming with senior developers on small coding tasks\nIntroduction to the team's codebase and development practices\n\nWeek 2:\n\nIntroduction to the company's product management and QA processes\nInitial project assignments and code reviews with senior developers\nParticipation in daily stand-up meetings and sprint planning sessions\nAttending code reviews and meetings to learn the team's coding standards and best practices\nWorking with the development team to develop code that meets the coding standards and integrates with the team's processes\n\nWeek 3:\n\nDeeper dive into the company's development methodologies\nAdditional project assignments and code reviews\nDevelopment of new features under supervision and guidance of senior developers\nContinued participation in daily stand-up meetings and sprint planning sessions\nProgress review and feedback from senior developers\nIntroduction to the company's testing and deployment processes\n\nWeek 4:\n\nMore independent development assignments with increasing complexity\nContinued participation in daily stand-up meetings and sprint planning sessions\nParticipation in the code review process and peer review of other developers' code\nIntroduction to other company departments such as sales, marketing, and customer support\nPerformance review with the team lead to discuss progress, feedback, and areas for improvement\n\nRequirements:\n\nMust be able to work independently in a remote environment\nStrong knowledge of at least one programming language such as Javascript, PHP, Python\nProven ability to navigate databases and extract files\nFamiliarity with software development principles and practices\nExperience with version control systems such as Git\nOutstanding problem-solving and analytical skills\nStrong attention to detail & solution-driven mentality\nUp-to-date with modern databases and technologies\nAbility to work in a very fast-paced and constantly changing environment\nAwareness to self-check work and troubleshoot any issues\nSelf-reliant to navigate various computer software programs\nKnowledge of finance, trading and direct response publishing a plus (not required)\nBachelor's degree in Computer Science, Software Engineering or a related field (not required)\n\nBenefits\n\nHealthcare\n401K eligibility w\/ match program\nPaid Time Off (PTO) days & Paid Holidays\nCharitable contribution match program\n\nJob Type: Full-Time\nLocation: Jacksonville, FL (Continental USA remote work OK; must be able to work during normal business hours 8a-5p EST)\nJob Type: Full-time\nPay: From $40,000.00 per year\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nParental leave\nVision insurance\n\nSchedule:\n\nMonday to Friday\n\nWork Location: RemoteHealth insurance","4":"Company Overview:\nOmphalos Lifesciences is a growing biotechnology company that is developing a software platform that will enable the virtualization (simulation and visualization) of all life forms, transcending space and time.\nJob Overview:\nWe are looking for a skilled software developer to join our team. The successful candidate will be responsible for designing, developing, and maintaining new features in our software.\nResponsibilities:\n\nCollaborate with the team to develop and design new features.\nWrite clean, efficient, and well-documented code.\nOptimize software applications to increase speed and scalability.\nDebug and troubleshoot software issues.\n\nQualifications:\n\nBachelor’s degree in Computer Science or related field.\nProven ability to generate clean and efficient code.\nProficiency with one or more programming languages (C++, Python, etc.).\nExperience with software design\nExcellent communication and collaboration skills.\nStrong analytical and problem solving skills.\nExperience with 3D graphic rendering.\n\nJob Type: Full-time\nPay: From $70,000.00 per year\nBenefits:\n\nHealth insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nAbility to commute\/relocate:\n\nDallas, TX: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\nREST: 1 year (Preferred)\nJava: 1 year (Preferred)\n\nWork Location: One locationHealth insurance","5":"\nOverview\n JST is currently seeking a Junior Developer to join our team. The developer will perform data modeling, internal control and risk analysis, modern business methods, and performance measurement techniques for the product.\n This is a full-time remote position. JST offers a full benefit package, a collaborative work environment and strong company culture. Veterans and military spouses are encouraged to apply. \n\nResponsibilities\n\n Apply enterprise architecture techniques to the financial application platform as well as coding design and transaction\/workflow analysis. \nWill perform data modeling, internal control and risk analysis, modern business methods, and performance measurement techniques for the product. \nWork with the client resources and team of other consultants to document and structure as-is and to-be documentation to support the modernization of a legacy financial statement and budget system to a commercial CPM platform. \nAssist in all conversion, design, and training activities throughout program planning and execution.\n\n Jr. Developer Qualifications\n\n A Bachelor's degree is required in the physical\/ life sciences, engineering, or business\/finance\/accounting.\n Experience or classes with Java, ETL\/SQL, or Python required. \nThe ability to obtain a U.S. Government security clearance.\n\n Jr. Developer Desired Qualifications\n\n General knowledge of federal financial management processes and requirements \nExperience on SQL Server or Oracle databases\n NET development experience \nOBIEE, Hyperion, OneStream, or BPC Financial Reporting development \nCurrent U.S Government Secret clearance \nWork experience in a technical field with hands-on experience with OneStream\n\n Required Clearances and Screenings\n\n A SECRET CLEARANCE IS REQUIRED\n MUST be able to successfully pass a drug screen and background check\n COVID-19 vaccination may be a required condition of employment\n\n About Joint Strategic Technologies (JST) \nNo objective is beyond reach! Joint Strategic Technologies (JST) enables successful mission outcomes from the back office to the battlefield. Our team includes leading experts from military, government and the private sector, all working together to help federal customers make a difference. Our goal is to Elevate the Impact that our employees have on our customers and treat every employee as a valued member of our team. JST empowers employees to make decisions and take-action, thus improving overall organizational growth and employee development. \n\nCulture isn't something you talk about. It's something you do. JST is committed to creating a positive environment 'that reaches beyond work and careers' to support every employee's professional and personal objectives. JST values the well-being of every employee and encourages healthy lifestyles, family activities and community involvement. \n\nJST is a proud equal opportunity employer. All qualified applicants will be considered for employment without attention to age, race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status. JST will not tolerate discrimination or harassment.\n","6":"\n\nPosition Purpose:\n The Staff Software Engineer is responsible for leading a team of engineers building and designing a product that our customers and associates love. As a Staff Software Engineer, you will be part of a dynamic team with engineers of all experience levels who help each other build and grow technical and leadership skills while creating, deploying, and supporting production applications. In addition, Staff Software Engineers will assist in product and tool selection, configuration, security, resilience, performance tuning and production monitoring. Staff Software Engineers contribute to foundational code elements that can be reused as well as architectural diagrams and other product-related documentation. As a Staff Software Engineer, you will be a core player on the product team and are expected to build and grow the skillsets of the more junior Engineers.\n Key Responsibilities:\n\n 50% Delivery and Execution - Develops, tests, deploys, and maintains software, with a clear understanding of the value the software is to provide; Takes a broad view when approaching issues; using a global lens; Consistently achieves results, even under tough circumstances; Develops test suites (functional, destructive, etc) to enable success, rapid deployment of code to production; Takes on new opportunities and tough challenges with a sense of urgency, high energy and enthusiasm; Consistently achieves results, even under tough circumstances\n 10% Learns and Grows - Actively seeks ways to grow and be challenged using both formal and informal development channels; Learns through successful and failed experiment when tackling new problems\n 20% Plans and Aligns - Creates new and better ways for the organization to be successful; Delivers multi-mode communications that convey a clear understanding of the unique needs of different audiences; Works the Product Team to ensure user stories are developer ready, easy to understand and testable; Collaborates with other team members in agile processes; Relates openly and comfortably with diverse groups of people; Adapts approach and demeanor in real time to match the shifting demands of different situations\n 20% Supports and Enables - Fields questions from product and engineering teams; Helps grow junior engineers by providing guidance on modern software development frameworks, and leading technical discussions; Notes gaps on the team and provides suggestions for changes to make the team more productive\n\n Direct Manager\/Direct Reports:\n\n This position typically reports to Software Engineer Manager or Sr. Manager\n This position typically has 0 Direct Reports\n\n Travel Requirements:\n\n No travel required.\n\n Physical Requirements:\n\n Most of the time is spent sitting in a comfortable position and there is frequent opportunity to move about. On rare occasions there may be a need to move or lift light articles.\n\n Working Conditions:\n\n Located in a comfortable indoor area. Any unpleasant conditions would be infrequent and not objectionable.\n\n\n\n Minimum Qualifications:\n\n Must be eighteen years of age or older.\n Must be legally permitted to work in the United States.\n\n Preferred Qualifications:\n\n 5-7 years of relevant work experience\n Extensive experience with front end technology such as HTML, CSS, and Javascript\/Typescript frameworks, an object-oriented programming language (preferably Java), Relational or noSQL database technology, cloud computing techniques, CI\/CD tools, modern software design patterns\n Experience in effective data modeling with both Relational and NoSQL databases\n Experience with security frameworks for user and services authorization and authentication\n Experience with creating and executing unit, functional, destructive and performance tests\n Experience with modern debugging and root cause analysis techniques\n Experience with version control system\n Experience in designing systems for High Availability, Disaster Recovery, Performance, Efficiency, and Security\n Exposure to developing technical roadmaps including work estimation, refactoring and modernizing legacy systems\n\n\n Minimum Education:\n\n The knowledge, skills and abilities typically acquired through the completion of a bachelor's degree program or equivalent degree in a field of study related to the job.\n\n Preferred Education:\n\n No additional education\n\n Minimum Years of Work Experience:\n\n 5\n\n\n Preferred Years of Work Experience:\n\n No additional years of experience\n\n Minimum Leadership Experience:\n\n None\n\n Preferred Leadership Experience:\n\n None\n\n Certifications:\n\n None\n\n Competencies:\n\n Global Perspective\n Manages Ambiguity\n Nimble Learning\n Self-Development\n Collaborates\n Cultivates Innovation\n Situational Adaptability\n Communicates Effectively\n Drives Results\n Interpersonal Savvy\n\n\n","7":"\nAbout Concept3D\n Founded in 2006, Concept3D is a leader in creating immersive online experiences with 3D modeling, interactive maps, and virtual tours. Our products include an online experience platform developed to support marketing, sales, and business processes in a countless number of industries. Our solutions marry art and science in highly detailed, interactive 3D renderings that breathe life into the digital world. In 2022, Concept3D acquired Localist, the leading event calendar platform for higher education communities. Concept3D and Localist have a shared belief that events and in-person connections are key to building community. \nTeam Culture\n We are a group of dedicated and multi-faceted individuals who are self-motivated and are excited to be a part of a company that is charting the future of interactive maps, tours and events. We define ourselves through the values by which we operate. Employees have an opportunity to learn all elements of the business, and direct access to the leadership team. Our teams are full of ideas and everyone's voice gets heard. While our offices are located in Denver, Colorado, and Minneapolis, Minnesota, we currently are operating remotely with a nationally-distributed team.\nJob Summary\n As a Junior Software Engineer, you will report directly to the VP of Software Engineering, who will be primarily responsible for providing direction and evaluating your performance.\nThis position is for a junior role within our engineering organization, someone who exemplifies our core values, works well with fellow engineering team members, and has the aptitude and drive to learn and contribute in the frontend and backend technologies needed to enhance and evolve our SaaS interactive mapping and virtual tour products. \nResponsibilities\n\nDevelop software adhering to the team’s established best practices and processes\nEnsure product quality through development of automated tests\nFix bugs with existing code\nContribute to new feature development where established patterns for implementation exist\nProvide and receive peer code reviews\nEmploy continuous learning through hands-on experience and mentorship within the team\n\nRequirements\n Who You Are (do you identify with a majority of these?)\n\nYou are early in your career as a software engineer and are eager to learn, grow, and contribute.\nYou have a desire to develop rich, interactive applications in the cloud.\nYou can proficiently write code in JavaScript.\nYou have experience with agile software development and working as part of a collaborative agile team.\nYou can demonstrate knowledge of computer science principles.\nYou have familiarity with CI\/CD practices.\n\nPreferred Technologies (do you have experience with some of these?)\n\nJavaScript (React, Node.js, Express)\nMapping Technologies (Google, Mapbox, Leaflet, ESRI, Open Street Maps)\nDocker\nAWS\n\nBenefits\n\nExcellent Medical, Dental, and Vision benefits for you and your family\nFlexible Paid Time Off program\n14 Paid Holidays Annually + your Birthday!\n401(k) Plan with Employer Match\nShort Term and Long Term Disability Insurance\nLife Insurance (Basic, Voluntary & AD&D)\nEmployee Stock Option Plan\nAnnual Education\/Development for continued learning\nAnnual Travel Allowance perk\nWork from Home Office perk\n\nCompensation\n The base salary range for this position is $60,000-$100,000 annually. Final compensation for this role is determined by a variety of factors, such as a candidate’s relevant work experience, skills, and certification.\n\n","8":"\n Junior Software Developer\n  Job Category: Information Technology\n  Time Type: Full time\n  Minimum Clearance Required to Start: None\n  Employee Type: Regular\n  Percentage of Travel Required: Up to 25%\n  Type of Travel: Local\n \n We are seeking talented Software Developer professionals that are excited to improve battlespace awareness and decision-making support at all echelons across Combat Air Force (AF) Command and Control (C2) and Intelligence, Surveillance and Reconnaissance (ISR) enterprise, Intelligence Community (IC), Joint, and Coalition air, space, cyberspace, and intelligence components, systems, and architectures. You’ll support software development and engineering, operations and maintenance (O&M) and research and development (R&D) for AF C2 & ISR related research, studies, analysis, operations, and you’ll increase mission effectiveness, improve information security, and implement new and emerging information access, processing, analysis and dissemination technologies in response to critical AF and IC multi-domain needs across Air, Space, and Cyber. This is your opportunity to work with a highly talented engineering team that builds technology that bridges software and intelligence community needs. Our client engagement processes, the way we collaborate, operate, and deliver value provides an unparalleled opportunity to grow and advance. Choose us and make delivering innovative work part of your extraordinary career.\n\n What You’ll Get to Do:\n\n Operate in all phases of the application lifecycle.\n Use of industry proven design patterns and open-source tools is encouraged, along with a dedication to staying educated on current technology trends.\n Provide design and development expertise in support of both new application development tasks and maintenance.\n Be part of an agile team where communication skills and the ability to execute within the established development process are paramount to yours and the team's success.\n Support the entire product lifecycle to include systems engineering and requirement analysis, technical design, system integration, implementation, and deployment.\n\n\n\n You’ll Bring These Qualifications:\n\n Ability to obtain a TS\/SCI Clearance.\n 0-3 years experience with modern software development, e.g., Java (J2EE), C++, C#, JavaScript, etc. as part of a development team utilizing strict configuration management practices e.g., git, Bitbucket, Gitlab, GitHub.\n 0-3 years experience using AGILE SCRUM or other similar methodology preferred. Familiarity with Agile methodology required.\n Experience with modern web application development to include JavaScript, Node.js, Angular or React.\n Experience with Big Data technologies such as Hadoop, Kafka, Zookeeper, Elastic Search\/ELK.\n Experience with industry standard build, packaging, and deployment tools such as Jenkins, Gitlab, Maven, Yum, NPM, and RPM.\n Linux experience.\n Intermediate debugging and run time skills needed.\n\n These Qualifications Would be Nice to Have:\n\n Experience with a major cloud provider, e.g., Amazon Web Services, Microsoft Azure.\n Experience with C2 and C4I systems.\n Experience with AF and DoD data sources like MARS, MIDB, FISHNET, and DIODE.\n Experience in containerization for development and cloud deployment. e.g. Docker, Kubernetes, OpenStack.\n Experience with DevSecOps and\/or CI\/CD.\n Experience in designing and developing RESTful interfaces.\n Secure coding experience within a classified space.\n Shell scripting experience in major operating system, e.g. Windows and Linux.\n\n\n\n    What We Can Offer You:\n   \n\n\nWe’ve been named a Best Place to Work by the Washington Post.\n\n\n\nOur employees value the flexibility at CACI that allows them to balance quality work and their personal lives.\n\n\n\nWe offer competitive benefits and learning and development opportunities.\n\n\n\nWe are mission-oriented and ever vigilant in aligning our solutions with the nation’s highest priorities.\n\n\n\nFor over 55 years, the principles of CACI’s unique, character-based culture have been the driving force behind our success.\n\n\n\n Company Overview: At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is an Equal Opportunity Employer – Females\/Minorities\/Protected Veterans\/Individuals with Disabilities.\n  Pay Range: The proposed salary range for this position is $45,300-$90,600. There are a host of factors that can influence final salary including, but not limited to, geographic location, Federal Government contract labor categories and contract wage rates, relevant prior work experience, specific skills and competencies, geographic location, education, and certifications. Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives. We offer competitive compensation, benefits and learning and development opportunities. Our broad and competitive mix of benefits options is designed to support and protect employees and their families. Employment benefits include health and wellness programs, income protection, paid leave and, life insurance, retirement and savings.\n \n As a federal contractor, CACI is subject to any federal vaccine mandates or other customer vaccination requirements. All new hires are required to report their vaccination status.\n","9":"\nAMDA College and Conservatory of the Performing Arts, with campuses in Los Angeles and New York City, is one of the foremost performing arts colleges in the country. AMDA offers Bachelor of Fine Arts degree programs in Acting, Musical Theatre, Dance Theatre and Performing Arts, as well as a two-year conservatory programs.\n Working alongside our Full Stack Web Developer, you will help tackle a variety of initiatives including day-to-day website updates, web development\/design, Quality Assurance testing, as well as helping brainstorm on future improvements. This a full-time position and a great opportunity for you to grow and expand your skillset. You will work in a fast-paced and changing environment with a small, dynamic team having a direct impact.\n Desired Skills and Experience:\n\n Previous web development experience.\n Deep understanding of HTML, JavaScript, CSS, jQuery, and React.js.\n Experience with Laravel or other PHP frameworks.\n Understanding of web standards, cross browser\/platform compatibility, and usability and accessibility best practices.\n Responsive web-design experience.\n Collaborative team player.\n Ability to think calmly and clearly while problem solving in stressful situations.\n Ability to learn quickly, without being afraid to ask questions if something isn’t understood\n\n Preferred candidates would also meet the following criteria:\n\n A passion for web, mobile, and other digital trends, technologies, and design.\n 1+ years professional web developer experience, demonstrating ability to meet deadlines without sacrificing quality.\n Experience with MySQL using software such as Sequel Pro or phpMyAdmin.\n Familiarity with modern front-end frameworks such as React.js\n Experience with 3rd party plugins such as video players, social feeds, and other widgets.\n Experience with version control software such as GitHub.\n Experience running local environments using tools such as MAMP.\n Ability to compare 2 files to quickly determine what’s different.\n Ability to bug test by using traces as well as browser developer tools in Chrome and Safari.\n Strong\/fluent command of a Mac preferred\n Experience and interest in using various operating systems, devices, and browsers (for testing and understanding various users).\n Bachelor's degree preferred.\n\n\n Diversity and Qualifications:\n\nAMDA is fully committed to diversity, inclusivity, and equity throughout the teaching and learning process. We encourage applications from individuals who have extensive experience working with students from diverse backgrounds.\nSuccessful candidates will have a sensitivity to, and understanding of, the diverse academic, socioeconomic, cultural, gender identity, sexual orientation, and ethnic backgrounds of our students, including disabilities that may affect students' development and learning styles.\nMembers of traditionally underrepresented groups are encouraged to apply.\n\n COVID19 Vaccine Policy:\n AMDA has a mandatory COVID-19 vaccine policy for all employees who will be working on campus. \nFor information regarding requests for religious or medical accommodations, please contact the Human Resources Department at LAHumanResources@amda.edu \nAMDA is proud to be an EOE employer M\/F\/D\/V.  The salary range for this position is $65,000 - $70,000 annually.\n","10":"\nAre you looking for a career with a company known for it's culture and investment in its people? Are you looking for an amazing retirement program, best in class health insurance and a robust benefits package? Are you looking to work in an environment where you feel appreciated and part of a work family?\n If so, 4M Research is the employer for you!\n 4M Research, Inc. (4M) is a Woman owned small business established in 2007 and headquartered in Huntsville, AL. 4M specializes in Systems and Software Engineering and Analysis, Information Technology, Planning and Analysis, and Field Support Services to a variety of customers including MDA, NASA, and AMCOM. Our continuous and rapid growth is attributable to the caliber of employees 4M strives to hire and retain. \nWe are currently seeking a Junior Level Software Engineer for our team in Huntsville, AL.\n The selected candidate will perform the following functions:\n\n Provides system\/software engineering and technology innovation to Army Air and Missile Defense, Aviation, and\/or MDA software solutions\n Supports technical aspects of the program including the system engineering process, program progress, analysis, and the output of the technical team\n Ensures all technical activities are identified, executed and documented\n Utilizes technical background working in requirements development, design, traceability, interoperability, continuous integration, and system testing of software-intensive systems\n Reviews and filters technology opportunities, promising activities, and technical gaps based upon projected capability needs\n Supports the technical performance of the project through control activities including reviews, metrics data collection, identifying corrective actions and ensuring implementation\n Supports automated software test and pipeline development activities\n Identifies and tracks risks associated with program\/software interfaces, development, and integration\/test activities\n Reports project technical status and progress to the technical and programmatic staff\n Utilizes proficiency in Microsoft Office Suite applications, as well as strong verbal and written communication skills\n\n Required Qualifications:\n\n Ability to comply with all laws and regulations including those concerning the COVID 19 vaccination mandate\n ABET accredited BS in STEM or related technical field\n Minimum 2 years of related experience\n Background in software development (C++, JAVA)\n Knowledge of the complete Software\/Systems Development process and lifecycle\n Some Travel\n Ability to obtain and maintain a Secret Security Clearance\n\n Desired Qualifications:\n\n Knowledge of requirements management tools (e.g. DOORS)\n Strong Background in Java\n Strong Background in C\/C++\n Background in JavaScript\n Experience developing and maintaining System\/Software Engineering artifacts\n Analysis of software source code and binary executable files \nExperience in software analysis tools such as Understand, CodeSonar, CodeDx, and CodePeer\n\n Please Note: US Citizenship is required\n Qualified candidates should apply online at www.4mresearch.com.\n For assistance call 256-319-4646.\n 4M Research, Inc. is an Affirmative Action\/ Equal Opportunity Employer and an active participant in the Employment Eligibility Verification Program (E-Verify).\n","11":"\n\nRed Technologies is a fast-growing company that empowers you to make a difference in an ever-changing industry through advanced platforms and technologies.\n\n What You'll Be Doing:\n We are looking for a Jr. UX\/UI Designer to join our growing team.\n Our UX\/UI Designer is responsible for creating world-class products and experiences by informing the product vision and translating that into a definition of concrete product design requirements that successfully meet user needs and business goals.\n You will work with leadership to help achieve the company's goals and improve our ways of working. Red Technologies will drive you to create the best, well-crafted product. You will report to and collaborate with our Sr. UX\/UI Designer.\n Our Ideal Candidate Has:\n\n0-2 years' experience\nMust have a portfolio of UI\/UX work.\nBasic knowledge of design systems (Familiarity with Material Design a plus)\nExperience with Figma or similar design tools\nAbility to communicate and collaborate with developers.\nKnowledge of basic design\/UX terms such as components, wireframes, user flows\nProduce high-quality solutions through flow diagrams, mockups, storyboards, and site maps.\nProtype responsive designs\/solutions for multiple device sizes and media\n\nGreat Growth: Our fast-growing company allows you to create your own path. We hire people who are driven to succeed, and we back them up with the training and support that helps them grow.\n Great People: Work in an inclusive culture with an engaged energized team of people who are committed to a common vision of doing the little things right.\n Great Technology: Red Technologies is a game-changing proprietary software that's been designed and developed with our shippers, carriers, and drivers in mind.\n Great Relationships: We are more than just a broker. Spot is dedicated to making sure every shipment, every customer, and every contract carrier is taken care of. That's why, no matter what time of day, we're always available.\n Great Benefits: Comprehensive medical, dental, and vision insurance. Company-paid STD and Life insurance. 401k with employer match and Paid Time Off. Modern, uptown office.\n\n\n #REDTMS\n #LI-ZH1\n\n Spot Freight, Inc. provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state, or local laws. Spot Freight is committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a disability, you need a reasonable accommodation, please contact our Human Resources team to notify us of your request. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.\n\n","12":"\n In a world of possibilities, pursue one with endless opportunities. Imagine Next! \n When it comes to what you want in your career, if you can imagine it, you can do it at Parsons. Imagine a career working with intelligent, diverse people sharing a common quest. Imagine a workplace where you can be yourself. Where you can thrive. Where you can find your next, right now. We’ve got what you’re looking for. \n \nJob Description: \nParsons is looking for an amazingly talented Junior Software Reverse Engineer to join our team! In this role you will provide program support in an experienced team environment analyzing software products \n\nWhat You'll Be Doing: \n\nAnalyzing software products \nDeveloping custom software analysis tools as needed \nSolving challenging puzzles and providing creative solutions \nWorking with senior engineering staff \n\n\nWhat Required Skills You'll Bring: \n\nBS or MS in Electrical, Computer, or Software Engineering and 0-2 years of experience \nUS Citizenship. Secret clearance is required to start, and you must be willing and able to obtain\/maintain a DoD TS\/SCI with CI polygraph security clearance. \nFundamental understanding of computer hardware architecture \nExperience with C\/C++, Python, assembly, or other programming languages \nAbility to self-research and problem solve \nEffective communication skills with technical team members, managers, and customers \n\n What Desired Skills You'll Bring: \n\nEmbedded microprocessor experience \nHardware\/circuit design and development \nVirtual Machines (VirtualBox, ESXi, VMware, QEMU) knowledge \nDisassembly\/decompiler (IDA Pro, Ghidra, OllyDbg, etc.) \n\n\nMinimum Clearance Required to Start: Secret \n This position is part of our Federal Solutions team. \n Our Federal Solutions segment delivers resources to our US government customers that ensure the success of missions around the globe. Our diverse, intelligent employees drive the state of the art as they provide services and solutions in the areas of defense, security, intelligence, infrastructure, and environmental. We promote a culture of excellence and close-knit teams that take pride in delivering, protecting, and sustaining our nation's most critical assets, from Earth to cyberspace. Throughout the company, our people are anticipating what’s next to deliver the solutions our customers need now. \n \nSalary Range: $59,300.00 - $103,800.00 \n We value our employees and want our employees to take care of their overall wellbeing, which is why we offer best-in-class benefits such as medical, dental, vision, paid time off, Employee Stock Ownership Plan (ESOP), 401(k), life insurance, flexible work schedules, and holidays to fit your busy lifestyle! \n \nThe position may require a COVID vaccination or an approved accommodation\/exemption for a disability\/medical condition or religious belief as required by customer requirements and some cases federal, state, provincial or local mandates. \nParsons is an equal opportunity employer committed to diversity, equity, inclusion, and accessibility in the workplace. Diversity is ingrained in who we are, how we do business, and is one of our company’s core values. Parsons equally employs representation at all job levels for minority, female, disabled, protected veteran and LGBTQ+. \n We truly invest and care about our employee’s wellbeing and provide endless growth opportunities as the sky is the limit, so aim for the stars! Imagine next and join the Parsons quest—APPLY TODAY!\n","13":"\n Responsibilities: \n \n   Peraton is searching for a talented Junior .Net Software Developer to become part of Peraton’s Citizens Security & Public Services, State and Local Regional team supporting a contract with the State of West Virginia. This position will be located on a client site Charleston, WV.\n \n\n\n What you’ll do:\n \n\n\n The Jr. .Net Software Developer will be responsible for the following, but not limited to: \n \n\nThe Developer will need to write complex queries in MS SQL, support web-based application systems, be able to solve problems and have the ability to use MS Office Tools.\n\n\n Collaborate with team members to determine best practices and client requirements for software with scrum and agile methodology.\n Develop intuitive software that meets and exceeds the needs of the client and company.\n Professionally maintain all software and create updates regularly to address customer concerns.\n Analyze and test programs and products before formal launch.\n Troubleshoot coding problems quickly and efficiently to ensure a productive workplace.\n Aid and support the coaching and training of other team members.\n Qualifications: \n \n Basic Qualifications: \n\n\nBachelor of Science Degree and 0-2 years experience or high school diploma\/equivalent and 6+ years of experience\n Experience in software engineering to include using .Net, C++, PowerShell, MS SQL Server\n Experience troubleshooting complex systems.\n Working with web services, APIs,\n Working with distributed, large scale, highly available systems\n Possess the professional and technical skills necessary to perform .Net software development as part of an application development team.\n\n\n   Benefits:\n \n\n\n At Peraton, our benefits are designed to help keep you at your best beyond the work you do with us daily. We’re fully committed to the growth of our employees. From fully comprehensive medical plans to tuition reimbursement, tuition assistance, and fertility treatment, we are there to support you all the way.\n \n\n Peraton Overview: \n \n   Peraton drives missions of consequence spanning the globe and extending to the farthest reaches of the galaxy. As the world’s leading mission capability integrator and transformative enterprise IT provider, we deliver trusted and highly differentiated national security solutions and technologies that keep people safe and secure. Peraton serves as a valued partner to essential government agencies across the intelligence, space, cyber, defense, civilian, health, and state and local markets. Every day, our employees do the can’t be done, solving the most daunting challenges facing our customers.\n  Salary Range: Salary Minimum: $40,000 Salary Mid: $80,000 Salary Maximum: $100,000 The estimate displayed represents the typical salary range for this position, and is just one component of Peraton's total compensation package for employees. Other rewards may include annual bonuses, short- and long-term incentives, and program-specific awards. In addition, Peraton provides a variety of benefits to employees. EEO Tagline (Text Only): An Equal Opportunity Employer including Disability\/Veteran.\n","14":"Junior Java Developer - Agri Stats\nDo you have 1+ years of experience with Java technologies? Are you looking for a relaxed atmosphere where you can build upon your Java Knowledge? Are you looking for an opportunity to reach your full potential, be taken seriously and contribute in a small and agile organization?\nOur open position of Java Developer is just that opportunity! We are looking for an individual that will learn our business and have a desire to grow into a technical leadership position.\nThe Position\nThe essential functions of the position would be to:\n\nUnderstand and participate in functional and technical design document creation\nDesign, implement and test software as per specifications\nLearn and adopt Java Web Platform technologies\nDevelop solutions using Java and Vaadin web technologies\nInterpret functional and technical documents to produce software solutions\nWork with end users in the designing, testing and implementation of software solutions\n\nThe Qualifications\nThe Java developer will have a good foundation in computer science, with competencies in data structures and software design.\n\nExcellent programming and problem-solving skills with an aptitude to learn and apply new technology skills.\n1+ years working in Java development; a full stack Java Developer is preferred.\nWork experience is desirable with: JDK, J2EE, SQL, Hibernate, Spring, Vaadin, Web page design and development (HTML, XML, AJAX, JSP, JQuery) and Tomcat.\nBack-end technologies knowledge: Relational databases and SQL\nFront-end technologies knowledge: Vaadin, JavaScript, HTML and JSP\nComfortable with Windows and Linux environments.\nAbility to work in a team environment as well as independently.\nJava 11 experience is desirable.\n\nCurrent Agri Stats Technologies\n\nApplication Development Tools: Java, Vaadin, Spring Boot, Hibernate, Eclipse, GIT, JSP, Struts\nDatabase: PostgreSQL\n\nThe Company\nAgri Stats has been in business since 1985 and our home office is located in Fort Wayne, IN with a second office in Chapecó, Brazil. We are the recognized leader in providing bench-marking reports and performance management consulting for the chicken, turkey, commercial egg and swine agribusinesses.\nOur employees are encouraged to give us continual feedback on our policies, procedures, and other topics related to being satisfied at work. Teamwork, the friendliness of staff and management, and the variety of work are often cited as positives at Agri Stats.\nPlease apply directly through this ad to ensure we receive your resume.\nJob Type: Full-time\nPay: $67,000.00 - $95,000.00 per year\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nFlexible schedule\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nAbility to commute\/relocate:\n\nFort Wayne, IN 46825: Reliably commute or planning to relocate before starting work (Preferred)\n\nExperience:\n\nJava Development: 1 year (Required)\n\nWork Location: One locationHealth insurance"},"date_posted":{"0":"Thu, 23 Mar 2023 20:49:14 GMT","1":"Thu, 23 Mar 2023 22:23:45 GMT","2":"Thu, 23 Mar 2023 22:05:35 GMT","3":"Thu, 23 Mar 2023 22:20:23 GMT","4":"Thu, 23 Mar 2023 21:17:52 GMT","5":"Thu, 23 Mar 2023 20:36:43 GMT","6":"Thu, 23 Mar 2023 21:26:37 GMT","7":"Thu, 23 Mar 2023 20:47:33 GMT","8":"Thu, 23 Mar 2023 22:29:26 GMT","9":"Fri, 24 Mar 2023 00:10:36 GMT","10":"Thu, 23 Mar 2023 20:43:10 GMT","11":"Thu, 23 Mar 2023 18:45:47 GMT","12":"Thu, 23 Mar 2023 14:35:57 GMT","13":"Thu, 23 Mar 2023 08:10:21 GMT","14":"Thu, 23 Mar 2023 18:43:01 GMT"},"min_salary":{"0":60000.0,"1":null,"2":null,"3":40000.0,"4":70000.0,"5":null,"6":null,"7":60000.0,"8":45300.0,"9":65000.0,"10":null,"11":null,"12":59300.0,"13":40000.0,"14":67000.0},"max_salary":{"0":100000.0,"1":null,"2":null,"3":-1.0,"4":-1.0,"5":null,"6":null,"7":100000.0,"8":90600.0,"9":70000.0,"10":null,"11":null,"12":103800.0,"13":-1.0,"14":95000.0},"salary_type":{"0":"YEAR","1":null,"2":null,"3":"YEAR","4":"YEAR","5":null,"6":null,"7":"YEAR","8":"YEAR","9":"YEAR","10":null,"11":null,"12":"YEAR","13":"YEAR","14":"YEAR"},"city":{"0":"Remote","1":"Panama City Beach","2":"Tampa","3":"Remote","4":"Dallas","5":"Washington","6":"Atlanta","7":"Remote","8":"Omaha","9":"Los Angeles","10":"Huntsville","11":"Indianapolis","12":"Huntsville","13":"Charleston","14":"Fort Wayne"},"country":{"0":"US","1":"US","2":"US","3":"US","4":"US","5":"US","6":"US","7":"US","8":"US","9":"US","10":"US","11":"US","12":"US","13":"US","14":"US"}}